<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class MastersTableSeeder extends Seeder
{
    public function run()
    {
        DB::table('masters')->insert([
            [
                'мастер_id' => 1,
                'имя' => 'Иван',
                'специализация' => 'Стрижка и укладка',
                'график_работы' => 'Пн-Пт 9:00-18:00',
                'created_at' => now(),
                'updated_at' => now()
            ],
            [
                'мастер_id' => 2,
                'имя' => 'Георгий',
                'специализация' => 'Бритьё и уход за бородой',
                'график_работы' => 'Ср-Вс 10:00-19:00',
                'created_at' => now(),
                'updated_at' => now()
            ],
            [
                'мастер_id' => 3,
                'имя' => 'Валентина',
                'специализация' => 'Уборка',
                'график_работы' => 'Пн-Пт 9:00-19:00',
                'created_at' => now(),
                'updated_at' => now()
            ],
            [
                'мастер_id' => 4,
                'имя' => 'Максим',
                'специализация' => 'Стрижка и укладка',
                'график_работы' => 'Пн-Ср 9:00-18:00',
                'created_at' => now(),
                'updated_at' => now()
            ],
            [
                'мастер_id' => 5,
                'имя' => 'Леонид',
                'специализация' => 'Бритьё и уход за бородой',
                'график_работы' => 'Пн-Пт 9:00-19:00',
                'created_at' => now(),
                'updated_at' => now()
            ],
            [
                'мастер_id' => 6,
                'имя' => 'Константин',
                'специализация' => 'Стрижка и укладка',
                'график_работы' => 'Ср-Сб 9:00-19:00',
                'created_at' => now(),
                'updated_at' => now()
            ]
        ]);
    }
}
