<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ServicesTableSeeder extends Seeder
{
    public function run()
    {
        DB::table('services')->insert([
            [
                'услуга_id' => 1,
                'название' => 'Мужская стрижка',
                'цена' => 1500,
                'специализация' => 'Стрижка и укладка',
                'created_at' => now(),
                'updated_at' => now()
            ],
            [
                'услуга_id' => 2,
                'название' => 'Бритьё опасной бритвой',
                'цена' => 3000,
                'специализация' => 'Бритьё и уход за бородой',
                'created_at' => now(),
                'updated_at' => now()
            ],
            [
                'услуга_id' => 3,
                'название' => 'Коррекция бороды',
                'цена' => 800,
                'специализация' => 'Бритьё и уход за бородой',
                'created_at' => now(),
                'updated_at' => now()
            ],
            [
                'услуга_id' => 4,
                'название' => 'Комплекс: стрижка и бритьё',
                'цена' => 1750,
                'специализация' => 'Стрижка и укладка, Бритьё и уход за бородой',
                'created_at' => now(),
                'updated_at' => now()
            ],
            [
                'услуга_id' => 5,
                'название' => 'Укладка волос',
                'цена' => 700,
                'специализация' => 'Стрижка и укладка',
                'created_at' => now(),
                'updated_at' => now()
            ],
            [
                'услуга_id' => 6,
                'название' => 'Окрашивание бороды',
                'цена' => 1000,
                'специализация' => 'Бритьё и уход за бородой',
                'created_at' => now(),
                'updated_at' => now()
            ],
            [
                'услуга_id' => 7,
                'название' => 'Королевское бритьё с уходом',
                'цена' => 1800,
                'специализация' => 'Бритьё и уход за бородой',
                'created_at' => now(),
                'updated_at' => now()
            ],
            [
                'услуга_id' => 8,
                'название' => 'Детская стрижка',
                'цена' => 1000,
                'специализация' => 'Стрижка и укладка',
                'created_at' => now(),
                'updated_at' => now()
            ]
        ]);
    }
}
